---
kind: type
id: T:Autodesk.Revit.DB.Architecture.StairsRunJustification
source: html/4d75bda7-267b-dc0e-286a-b5efb839655f.htm
---
# Autodesk.Revit.DB.Architecture.StairsRunJustification

The position of the run relative to the Up-direction path used to create the run.

## Syntax (C#)
```csharp
public enum StairsRunJustification
```